## Plans :thumbsup:
<details>
  <summary><h2>Terrateam Plan Output :thumbsup:</h2></summary>


**Dir**: terraform
**Workspace**: default
**Success**: :thumbsup:

```diff

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.gke-cinema.google_container_cluster.primary has changed
!   resource "google_container_cluster" "primary" {
        id                          = "projects/terrateam-362405/locations/us-central1/clusters/cinema"
        name                        = "cinema"
+       resource_labels             = {}
        # (26 unchanged attributes hidden)

+       node_pool {
+           initial_node_count          = 1
+           instance_group_urls         = [
+               "https://www.googleapis.com/compute/v1/projects/terrateam-362405/zones/us-central1-a/instanceGroupManagers/gke-cinema-core-650bc96f-grp",
+               "https://www.googleapis.com/compute/v1/projects/terrateam-362405/zones/us-central1-b/instanceGroupManagers/gke-cinema-core-8650bbcd-grp",
+               "https://www.googleapis.com/compute/v1/projects/terrateam-362405/zones/us-central1-c/instanceGroupManagers/gke-cinema-core-2250a1c5-grp",
            ]
+           managed_instance_group_urls = [
+               "https://www.googleapis.com/compute/v1/projects/terrateam-362405/zones/us-central1-a/instanceGroups/gke-cinema-core-650bc96f-grp",
+               "https://www.googleapis.com/compute/v1/projects/terrateam-362405/zones/us-central1-b/instanceGroups/gke-cinema-core-8650bbcd-grp",
+               "https://www.googleapis.com/compute/v1/projects/terrateam-362405/zones/us-central1-c/instanceGroups/gke-cinema-core-2250a1c5-grp",
            ]
+           max_pods_per_node           = 128
+           name                        = "core"
+           node_count                  = 1
+           node_locations              = [
+               "us-central1-a",
+               "us-central1-b",
+               "us-central1-c",
            ]
+           version                     = "1.24.3-gke.2100"

+           autoscaling {
+               max_node_count       = 6
+               min_node_count       = 3
+               total_max_node_count = 0
+               total_min_node_count = 0
            }

+           management {
+               auto_repair  = true
+               auto_upgrade = true
            }

+           node_config {
+               disk_size_gb      = 15
+               disk_type         = "pd-standard"
+               guest_accelerator = []
+               image_type        = "COS_CONTAINERD"
+               labels            = {
+                   "cluster_name" = "cinema"
+                   "node_pool"    = "core"
                }
+               local_ssd_count   = 0
+               machine_type      = "e2-medium"
+               metadata          = {
+                   "cluster_name"             = "cinema"
+                   "disable-legacy-endpoints" = "true"
+                   "node_pool"                = "core"
                }
+               oauth_scopes      = [
+                   "https://www.googleapis.com/auth/logging.write",
+                   "https://www.googleapis.com/auth/monitoring",
                ]
+               preemptible       = false
+               service_account   = "terrateam-tf@terrateam-362405.iam.gserviceaccount.com"
+               spot              = false
+               tags              = [
+                   "gke-cinema",
+                   "gke-cinema-core",
                ]
+               taint             = []

+               shielded_instance_config {
+                   enable_integrity_monitoring = true
+                   enable_secure_boot          = false
                }

+               workload_metadata_config {
+                   mode = "GKE_METADATA"
                }
            }

+           upgrade_settings {
+               max_surge       = 1
+               max_unavailable = 0
            }
        }

        # (19 unchanged blocks hidden)
    }

  # module.vpc-cinema.module.subnets.google_compute_subnetwork.subnetwork["us-central1/production"] has changed
!   resource "google_compute_subnetwork" "subnetwork" {
        id                         = "projects/terrateam-362405/regions/us-central1/subnetworks/production"
        name                       = "production"
!       private_ip_google_access   = false -> true
        # (11 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!   update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.gke-cinema.data.google_compute_zones.available will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "google_compute_zones" "available" {
+       id      = (known after apply)
+       names   = (known after apply)
+       project = "terrateam-362405"
+       region  = "us-central1"
    }

  # module.gke-cinema.data.google_container_engine_versions.region will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "google_container_engine_versions" "region" {
+       default_cluster_version         = (known after apply)
+       id                              = (known after apply)
+       latest_master_version           = (known after apply)
+       latest_node_version             = (known after apply)
+       location                        = "us-central1"
+       project                         = "terrateam-362405"
+       release_channel_default_version = (known after apply)
+       valid_master_versions           = (known after apply)
+       valid_node_versions             = (known after apply)
    }

  # module.gke-cinema.data.google_container_engine_versions.zone will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "google_container_engine_versions" "zone" {
+       default_cluster_version         = (known after apply)
+       id                              = (known after apply)
+       latest_master_version           = (known after apply)
+       latest_node_version             = (known after apply)
+       location                        = "us-central1-a"
+       project                         = "terrateam-362405"
+       release_channel_default_version = (known after apply)
+       valid_master_versions           = (known after apply)
+       valid_node_versions             = (known after apply)
    }

  # module.gke-cinema.google_container_cluster.primary will be updated in-place
!   resource "google_container_cluster" "primary" {
        id                          = "projects/terrateam-362405/locations/us-central1/clusters/cinema"
!       min_master_version          = "1.24.3-gke.2100" -> (known after apply)
        name                        = "cinema"
        # (26 unchanged attributes hidden)

        # (20 unchanged blocks hidden)
    }

  # module.gke-cinema.random_shuffle.available_zones must be replaced
-/+ resource "random_shuffle" "available_zones" {
!       id           = "-" -> (known after apply)
!       input        = [
-           "us-central1-a",
-           "us-central1-b",
-           "us-central1-c",
-           "us-central1-f",
        ] -> (known after apply) # forces replacement
!       result       = [
-           "us-central1-c",
-           "us-central1-f",
-           "us-central1-a",
        ] -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.external_dns.module.iam.google_service_account_iam_binding.service_account_iam_authoritative["default--roles/iam.workloadIdentityUser"] will be created
+   resource "google_service_account_iam_binding" "service_account_iam_authoritative" {
+       etag               = (known after apply)
+       id                 = (known after apply)
+       members            = (known after apply)
+       role               = (known after apply)
+       service_account_id = (known after apply)

+       condition {
+           description = (known after apply)
+           expression  = (known after apply)
+           title       = (known after apply)
        }
    }

  # module.external_dns.module.service_account.google_project_iam_member.project-roles["external-dns-terrateam-362405=>roles/dns.admin"] will be created
+   resource "google_project_iam_member" "project-roles" {
+       etag    = (known after apply)
+       id      = (known after apply)
+       member  = (known after apply)
+       project = "terrateam-362405"
+       role    = "roles/dns.admin"
    }

  # module.external_dns.module.service_account.google_service_account.service_accounts["external-dns"] will be created
+   resource "google_service_account" "service_accounts" {
+       account_id   = "external-dns"
+       disabled     = false
+       display_name = "Terraform-managed service account"
+       email        = (known after apply)
+       id           = (known after apply)
+       name         = (known after apply)
+       project      = "terrateam-362405"
+       unique_id    = (known after apply)
    }

  # module.vpc-cinema.module.subnets.google_compute_subnetwork.subnetwork["us-central1/production"] will be updated in-place
!   resource "google_compute_subnetwork" "subnetwork" {
        id                         = "projects/terrateam-362405/regions/us-central1/subnetworks/production"
        name                       = "production"
!       private_ip_google_access   = true -> false
        # (11 unchanged attributes hidden)
    }

Plan: 4 to add, 2 to change, 1 to destroy.

```

<details>
  <summary>To apply this directory and workspace...</summary>

```
terrateam apply dir:terraform workspace:default
```

</details>


</details>

To apply all these changes, comment:

```
terrateam apply
```


---

<details>
  <summary><h3>Feedback?</h3></summary>

Questions? Comments? Give feedback by commenting `terrateam feedback <your msg>`.  Your message lands directly in our inbox.

</details>
